[
    {
        "question_en": "Still showing the checkout PrestaShop by default. What's going on?",
        "answer_en": "<p>You have to check the following points:</p><p><ul><li>Check if in section BackOffice->Preferences->Order have put the purchase one page.</li><li>Check the overrides have placed in the correct paths as indicated at the time of install.</li><li>Enter FTP and delete the file in the following path \"/cache /class_index.php\".</li><li>Verify that the option \"Disable overrides\" BackOffice->Preferences>Performance is set to \"NO\".</li></ul></p><p>If you can not solve with this, please contact us to assist you.</p>",
        "question_es": "Sigue mostrando el proceso de compra por defecto de PrestaShop. ¿Qu&eacute; sucede?",
        "answer_es": "<p>Se tiene que revisar los siguientes puntos:</p><p><ul><li>Verificar si en el apartado BackOffice->Preferencias->Pedido tenga puesta la compra en una pagina.</li><li>Verificar que tenga colocados los overrides en las rutas correctas como lo indica al momento de instalarse.</li><li>Ingresar por FTP y borrar el fichero en la siguiente ruta \"/cache/class_index.php\".</li><li>Verificar que la opcion \"In-habilitar las sobre-cargas\" en BackOffice->Preferencias->Rendimiento este en \"NO\".</li></ul></p><p>En caso de no solucionar por favor contactarnos para atenderle.</p>"
    },
    {
        "question_en": "What should I do to put the newsletter subscription option, active and checked?",
        "answer_en": "You must go to settings module One Page Checkout PS and click on the \"Fields register\" tab and look for the field named \"newsletter\", activate it and then click the icon \"Edit\" in the \"Default value\" put the number one (1), save and ready.",
        "question_es": "¿Que debo hacer para dejar la opci&oacute;n  de suscripci&oacute;n a newsletter activo y marcado (checkeado)?",
        "answer_es": "Debe ir a la configuraci&oacute;n del m&oacute;dulo One Page Checkout PS y dar clic en la pestaña \"Campos de registro\" y buscar el campo con nombre \"newsletter\", cuando lo encuentre act&iacute;velo y luego dar al icono de \"Editar\" y en el campo habilitado \"Valor por defecto\" colocar el numero uno (1), guardar y listo."
    },
    {
        "question_en": "Testing the operation of the module \"One Page Checkout PS\" in the options tab there is a check to \"Request confirmation email at the time of registration\" If I do not understand wrong should send an email to confirm that the address is correct. I could confirm that the operation is correct.",
        "answer_en": "No, that option is for the moment a customer is entering their email address for the purchase, display another textbox requesting confirmation email entered above and prevent can write a wrong email.",
        "question_es": "Probando el funcionamiento del m&oacute;dulo \"One Page Checkout PS\" en la pesta&ntilde;a de opciones hay un check con \"Solicitar confirmaci&oacute;n del correo electr&oacute;nico al momento del registro:\" si no entiendo mal deber&iacute;a enviar un correo electr&oacute;nico para confirmar que la direcci&oacute;n es correcta. Me podr&iacute;an confirmar que es correcto el funcionamiento.",
        "answer_es": "No, esa opci&oacute;n es para que al momento que un cliente este ingresando su correo electr&oacute;nico para la compra, salga otro campo abajo pidiendo la confirmaci&oacute;n del correo electr&oacute;nico ingresado anteriormente y así evitar que puede escribir un correo electr&oacute;nico err&oacute;neo el cliente."
    },
    {
        "question_en": "When the customer is going to register to make a purchase there is a field in which the following appears: \"The personal information you give is used to respond to your searches, process your orders or authorize access to the specific information. Has right to change all personal information we hold about you on page \"my account \".How I can edit that text?",
        "answer_en": "This text puts it a module called \"Block data privacy of customers\" that can disable, remove, or configure as you like.",
        "question_es": "Cuando el cliente va a registrarse para hacer una compra hay un campo en el que aparece el siguiente texto: \"El dato personal que da esta utilizado para responder a sus b&uacute;squedas, procesa sus ordenes o autorizase el acceso especifico a la informaci&oacute;n. Tiene derecho de modificar todas las informaciones personales que tenemos sobre usted en pagina \"my account\".¿Como puedo editar ese texto?",
        "answer_es": "Ese texto lo pone un modulo llamado \"Bloque de privacidad de datos de los clientes\" que puede desactivar, quitar o configurar segun lo desee."
    },
    {
        "question_en": "How to create a Google API Key to autocomplete the address on registration customer?",
        "answer_en": "<p>Follow these steps:</p><p><ol><li> 1. Go to https://console.developers.google.com/</li><li>2. Select a project or create one if it does not.</li><li>3. Go to APIs and authentication -> APIs.</li><li>4. Search the API: Google Maps JavaScript API v3, select it and enable it.</li><li>5. Go Credentials and create a key of \"Access to public API.\"</li><li>6. Using this API key and placed in the module One Page Checkout PS  -> Register -> Option: Google API KEY.</li></p>",
        "question_es": "¿Como crear el API Key de Google para autocompletar la direcci&oacute;n en el registro de clientes?",
        "answer_es": "<p>Seguir los siguientes pasos:</p><p><ol><li> 1. Ir a https://console.developers.google.com/</li><li>2. Seleccionar un proyecto o crear uno si no lo tiene.</li><li>3. Ir a APIs y autenticación -> APIs.</li><li>4. Buscar el API: Google Maps JavaScript API v3, seleccionarla y habilitarla.</li><li>5. Ir a Credenciales y crear una clave de \"Acceso a API pública\".</li><li>6. Usar esta Clave de la API y colocarla en el módulo de One Page Checkout PS -> Registro -> Opción: Google API KEY.</li></ol></p>"
    },
    {
        "question_en": "How to change the default value of field State in the checkout?",
        "answer_en": "<p><strong>If you want to place a province by default, you must do the following:</strong></p><p>1. Go to BackOffice-&gt;Modules.</p><p>2. Search our module \"One Page Checkout PS\" and&nbsp;click on Configure.</p><p>3. In the left menu click on \"Register fields\".</p><p>4. Find the field \"id_state\" and click Edit.</p><p>5. In the option \"Default value\" to place the identifier (ID) of the state&nbsp;who want to make the default.</p><p>6. After click on Save button and ready.</p><p> </p><p><strong>If you want the client should always choose the province, you must do the following:</strong></p><p>1. Go to BackOffice-&gt;Modules.</p><p>2. Search our module \"One Page Checkout&nbsp;PS\" and&nbsp;click on Configure.</p><p>3. In the left menu click on \"Register&nbsp;fields\".</p><p>4. Find the field \"id_state\" and&nbsp;click Edit.</p><p>5. In the&nbsp;option \"Default value\" leave it empty.</p><p>6.&nbsp;After click on Save button and&nbsp;ready.</p>",
        "question_es": "¿C&oacute;mo cambiar el valor por defecto de campo Provincia en el carrito?",
        "answer_es": "<p><strong>Si desea colocar alguna provincia por defecto, debe hacer lo siguiente:</strong></p><p>1. Ir a BackOffice-&gt;Módulos.</p><p>2. Buscar nuestro modulo \"One Page Checkout PS\" y entrar a configurar</p><p>3. En el menú de la izquierda dar clic en \"Campos del registro\".</p><p>4. Buscar el campo \"id_state\" y editarlo.</p><p>5. En la opción \"Valor por defecto\" debe colocar el identificador de la provincia que desea poner por defecto.</p><p>6. Una vez cambiado, dar al botón de guardar y ya quedara por defecto dicha provincia.</p><p> </p><p><strong>Si desea que el cliente siempre deba escoger la provincia, debe hacer lo siguiente:</strong></p><p>1. Ir a BackOffice-&gt;Módulos.</p><p>2. Buscar nuestro modulo \"One Page Checkout PS\" y entrar a configurar</p><p>3. En el menú de la izquierda dar clic en \"Campos del registro\".</p><p>4. Buscar el campo \"id_state\" y editarlo.</p><p>5. En la opción \"Valor por defecto\" dejarlo vacío, sin ningún valor.</p><p>6. Una vez cambiado, dar al botón de guardar y ya quedara por defecto dicha provincia.</p>"
    }

]
